import MiniHero from '@/components/mini-hero';
import ServiseDescription from '@/components/servise-description';
import ServiseAdvantages from '@/components/servise-advantages';
import CostCalculation from '@/components/costCalculation';
import ContactsBanner from '@/components/contacts-banner';
import FAQ from '@/components/faq';
import Quote from '@/components/quote';
import ServiseWhenStart from '@/components/servise-when-start';

export function generateMetadata({ params, searchParams }, parent) {
	const servise = setData(params);

	const { metaData } = servise;

	return {
		title: metaData.title,
		description: metaData.description,
		openGraph: {
			images: metaData.image,
		},
	};
}

const data = {
	screed: {
		metaData: {
			title: 'Машинна Стяжка Підлоги',
			description: `Найкращий спосіб зробити підлогу ідеально рівною - це замовити Машинну напівсуху стяжку підлоги у спецалістів з компанії STPRO-VIN у Вінниці та області, 
			фіксована ціна протягом виконання роботи, безкоштовний виклик замірника, найкращий матеріал, до 300 кв\м за день, швидко, якісно та довговічно!`,
			image: '/images/screed-machine.png',
		},
		hero: {
			heading:
				'Машинна напівсуха стяжка підлоги: Ідеальна основа для Вашого житла',
			description: `Високоякісні рішення в області стяжки підлоги для максимального комфорту та довговічності. 
				Гарантуємо найрівнішу поверхню, швидкість та якість за приємну ціну у місті Вінниця та Вінницькій області.`,
			image: '/images/styazhka_4.jpg',
			alt: 'Міні-плакат - Машинна стяжка підлоги',
		},
		description: {
			heading: 'Що таке машинна стяжка підлоги?',
			description: [
				{
					paragraph: `Машинна напівсуха стяжка представляє собою ефективний метод вирівнювання поверхні підлоги, що використовує механізований підхід. 
				Цей спосіб знаходить своє застосування при ремонті квартир в новобудовах або приватних будинках, дозволяючи швидко та якісно вирівняти підлогу за передовою німецькою технологією.`,
				},
				{
					paragraph: `Основний компонент напівсухої стяжки – це суміш, яка включає великозернистий пісок, цемент, фіброволокно і пластифікатор. 
				Ці складові дозволяють досягти високої якості вирівнювання підлоги, ефективно усуваючи нерівності та значні перепади на її поверхні. 
				Використання цієї технології сприяє швидкому завершенню робіт і отриманню ідеальної гладкості підлоги, що є важливим етапом в будівельних та ремонтних процесах.`,
				},
			],
			image: '/hero.jpg',
			alt: 'STPRO-VIN машинна сятжка - опис',
		},
		advantages: {
			heading: 'Переваги машинної стяжки підлоги',
			list: [
				{
					text: `Швидкість виконання: машинна стяжка виконується швидше за ручну, тому що машинна техніка дозволяє розподілити матеріал рівномірно та швидко.`,
				},
				{
					text: `Висока якість: машинна стяжка забезпечує більш рівномірну та гладку поверхню, що робить її ідеальною для встановлення підлогових покриттів, 
					таких як ковролін, ламінат, плитка, паркет та ін.`,
				},
				{
					text: `Висока Міцність: Використання спеціальних добавок та якісних матеріалів забезпечує високу міцність стяжки, що робить її ідеальним вибором для будь-якого приміщення.`,
				},
				{
					text: `Економія матеріалів: машинна стяжка забезпечує більш точне дозування матеріалів, що дозволяє зменшити витрати на матеріали та знизити відходи.`,
				},
				{
					text: `Економія витрат: використання машинної стяжки підлоги може бути економічно вигіднішим за ручну стяжку. За рахунок зменшення часу, 
					витраченого на виконання робіт, зниження кількості матеріалів та кращої якості робіт, машинна стяжка може бути більш ефективним варіантом.`,
				},
			],
			image: '/images/styazhka_6.jpg',
			alt: 'Зашліфована стяжка підлоги 1',
		},
		whenStart: {
			heading: 'Коли варто робити стяжку:',
			list: [
				{
					text: `Після встановлення систем водопостачання та водовідведення: 
					Якщо ви плануєте встановити сантехніку або системи водопостачання та водовідведення, то перш за все необхідно встановити їх перед початком робіт зі стяжкою підлоги. 
					Встановлення цих систем перед стяжкою підлоги забезпечить можливість розташування труб та інших елементів підлоги за межами стяжки.`,
				},
				{
					text: `Після установки теплоізоляції: 
					Якщо ви встановлюєте теплоізоляцію підлоги, то рекомендується зробити стяжку після її встановлення. 
					Таким чином, ви можете впевнитися, що теплоізоляція захищена та правильно встановлена.`,
				},
				{
					text: `Перед встановленням підлогового покриття: 
					Якщо ви плануєте встановити підлогове покриття, таке як керамічна плитка або ламінат, то рекомендується зробити стяжку підлоги перед початком укладання покриття. 
					Це забезпечить рівну та стійку поверхню для укладання покриття.`,
				},
				{
					text: `Після завершення внутрішніх робіт: 
					Якщо ви робите ремонт в квартирі або будинку, то рекомендується починати роботи зі стяжкою підлоги після завершення внутрішніх робіт, 
					таких як фарбування, обшивка стін або установка дверей. Це допоможе зменшити можливість пошкодження стяжки підлоги під час проведення інших робіт.`,
				},
			],
			image: '/images/styazhka_work_3.jpg',
			alt: 'Процес роботи майстра STPRO-VIN',
		},
		prices: {
			ourMaterials: '280',
			customerMaterials: '180',
		},
		faq: [
			{
				label:
					'Що таке машинна напівсуха стяжка підлоги і чим вона краща за традиційну?',
				answers: [
					{
						paragraph: `Машинна напівсуха стяжка підлоги - це сучасний спосіб вирівнювання поверхні підлоги за допомогою спеціального розчину, який подається на об’єкт механізованим способом. 
						Така стяжка має ряд переваг перед традиційною, таких як: висока швидкість виконання, мінімальна вологість, висока міцність, рівномірність, екологічність, 
						можливість укладання на різні основи, зручність для подальшого покриття.`,
					},
				],
			},
			{
				label:
					'Яка товщина машинної напівсухої стяжки підлоги і як вона впливає на якість роботи?',
				answers: [
					{
						paragraph: `Товщина машинної напівсухої стяжки підлоги залежить від рівності основи, виду покриття і додаткових шарів, які можуть бути прокладені під стяжку, таких як теплоізоляція, гідроізоляція, армування тощо. 
						Зазвичай товщина стяжки коливається від 3 до 10 см. Якщо товщина стяжки занадто мала, це може призвести до її розтріскування, деформації або нерівномірності. 
						Якщо товщина стяжки занадто велика, це може призвести до зайвих витрат матеріалів, збільшення ваги стяжки і погіршення теплопровідності.`,
					},
				],
			},
			{
				label:
					'Як правильно підготувати основу під машинну напівсуху стяжку підлоги і які вимоги до неї?',
				answers: [
					{
						paragraph: `Основа під машинну напівсуху стяжку підлоги повинна бути міцною, стійкою, чистою, сухою і рівною. Перед укладанням стяжки необхідно зняти всі залишки попереднього покриття, пил, грязь, жир, масло, фарбу, грибок, плісняву тощо. 
						Також необхідно усунути всі тріщини, вибоїни, нерівності, порожнини, які можуть бути на основі. Якщо основа дуже нерівна, то потрібно зробити попередню стяжку або використати самовирівнюючу суміш. Якщо основа дуже волога, то потрібно зробити гідроізоляцію або використати спеціальні добавки, які зменшують вплив вологи на стяжку.`,
					},
				],
			},
			{
				label:
					'Як доглядати за машинною напівсухою стяжкою підлоги після її укладання і які терміни експлуатації вона має?',
				answers: [
					{
						paragraph: `Машинна напівсуха стяжка підлоги після її укладання потребує дотримання деяких правил догляду, щоб забезпечити її довговічність і якість. Основні правила догляду такі:`,
					},
					{
						paragraph: `1. Не ходити по стяжці протягом перших 24 годин після її укладання;`,
					},
					{
						paragraph: `2. Не ставити на стяжку важкі предмети, інструменти, обладнання протягом перших 7 днів після її укладання;`,
					},
					{
						paragraph: `3. Не укладати на стяжку кінцеве покриття протягом перших 28 днів після її укладання;`,
					},
					{
						paragraph: `4. Забезпечити оптимальний мікроклімат в приміщенні, де зроблена стяжка, тобто температуру від 15 до 25 градусів, вологість від 50 до 70%, вентиляцію і освітлення;`,
					},
					{
						paragraph: `Машинна напівсуха стяжка підлоги має досить високі терміни експлуатації, якщо дотримуватися правил догляду і використовувати якісні матеріали. 
						Зазвичай така стяжка служить від 10 до 20 років, але це також залежить від інтенсивності навантаження на підлогу, типу покриття, кліматичних умов тощо.`,
					},
				],
			},
		],
	},
	plaster: {
		metaData: {
			title: 'Машинна Штукатурка Стін',
			description: `Послуга Машинної штукатурки у місті Вінниця під ключ, зробимо все швидко якісно, зв'яжіться з нами та обговоримо деталі, якщо у вас великий об’єм робіт, 
			то вартість за кв\м може бути меншою. За допомогою спеціальної технології та кваліфікованих майстрів перетворимо ваші стіни на витвір мистецва`,
			image: '/images/plastering-machine.png',
		},
		hero: {
			heading: 'Машинна штукатурка стін: Новий рівень естетики та надійності',
			description:
				'Професійна обробка стін, яка поєднує елегантність, швидкість та якість за приємну ціну у місті Вінниця.',
			image: '/images/plaster_1.jpg',
			alt: 'Міні-плакат - Машинна штукатурка стін',
		},
		description: {
			heading: 'Машинна штукатурка стін',
			description: [
				{
					paragraph: `Машинна штукатурка стін представляє собою інноваційний, ефективний і економічний метод підготовки як зовнішніх, так і внутрішніх поверхонь перед завершальним оздобленням. 
					Цей сучасний підхід ґрунтується на використанні спеціальної машини, яка здатна працювати як з гіпсовими, так і з цементно-вапняними сумішами, забезпечуючи високий ступінь якості обробки поверхні. `,
				},
				{
					paragraph: `Процес машинного оштукатурювання включає кілька етапів, які допомагають досягти оптимальних результатів. По-перше, поверхню готують, очищаючи її від будь-яких дефектів і нерівностей. 
					Потім спеціальна машина рівномірно та швидко розподіляє штукатурку по стіні, дозволяючи отримати гладку і однорідну поверхню.`,
				},
				{
					paragraph: `Машинна штукатурка стін в м.Вінниця від нашої компанії – це не просто обробка поверхні, це творчий підхід який вразить своєю красою та індивідуальністю.`,
				},
			],
			image: '/hero_2.webp',
			alt: 'STPRO-VIN машинна штукатурка - опис',
		},
		advantages: {
			heading: 'Переваги машинної штукатурки',
			list: [
				{
					text: 'Швидкість виконання робіт: Машинний процес дозволяє ефективно виконувати штукатурні роботи, зекономивши час та забезпечивши якісний результат.',
				},
				{
					text: 'Міцність та стійкість: Матеріали високої якості гарантують міцність та стійкість покриття, що залишається незмінним протягом тривалого часу.',
				},
				{
					text: 'Рівномірність та гладкість: Завдяки точному дозуванню матеріалів та автоматизованому процесу нанесення, ми досягаємо ідеально гладкої поверхні.',
				},
				{
					text: 'Економія матеріалів: машинна штукатурка може ефективно використовувати матеріали, оскільки вона точно дозує їх та наносить на стіни без втрат.',
				},
			],
			image: '/images/plaster_4.jpg',
			alt: 'Машинна штукатурка "Переваги"',
		},
		whenStart: {
			heading: 'Коли варто робити стяжку:',
			list: [
				{
					text: `Будівництво нових будинків або ремонт і реконструкція старих: 
					Машинна штукатурка може бути корисною для створення рівномірного та гладкого шару на поверхнях стін, що дозволяє створити привабливий та якісний фініш.`,
				},
				{
					text: `Використання на великих площах: 
					Машинна штукатурка є швидшою та більш продуктивною, ніж ручна штукатурка, тому її можна застосовувати на великих площах, таких як склади, промислові будівлі, багатоквартирні будинки та інші.`,
				},
				{
					text: `Робота в умовах обмеженої доступності: 
					Машинна штукатурка може бути використана в умовах, коли ручна штукатурка є неможливою або неефективною.`,
				},
				{
					text: `Зниження вартості робіт: 
					Машинна штукатурка може допомогти знизити витрати на працю та матеріали порівняно з ручною штукатуркою, що може бути важливим фактором при бюджетуванні будівельних робіт.`,
				},
			],
			image: '/images/plaster_2.jpg',
			alt: 'Штукатурка стін (завершена)',
		},
		prices: {
			ourMaterials: '330',
			customerMaterials: '230',
		},
		faq: [
			{
				label:
					'Які види машинної штукатурки стін ви пропонуєте і як вибрати найкращий для мого інтер’єру?',
				answers: [
					{
						paragraph: `Ми пропонуємо два види машинної штукатурки стін: гіпсову і цементно-піщану.`,
					},
					{
						paragraph: `- Гіпсова штукатурка ідеально підходить для внутрішніх робіт, оскільки вона має високу адгезію, гладкість, білизну, паропроникність і вогнестійкість.`,
					},
					{
						paragraph: `- Цементно-піщана штукатурка рекомендується для зовнішніх робіт, оскільки вона стійка до атмосферних впливів, механічних пошкоджень, грибків і плісняви.`,
					},
					{
						paragraph: `Вибір виду штукатурки залежить від типу стін, кліматичних умов, бюджету і дизайну інтер’єру.`,
					},
				],
			},
			{
				label:
					'Які переваги машинної штукатурки стін перед ручною і чи є якісь недоліки?',
				answers: [
					{
						paragraph: `Машинна штукатурка стін має ряд переваг перед ручною, таких як: висока швидкість виконання, мінімальна витрата матеріалу, рівномірність і якість нанесення, 
						зниження фізичного навантаження на робітників, зменшення кількості пилу і бруду в приміщенні.`,
					},
					{
						paragraph: `Недоліки машинної штукатурки стін можуть бути такі: необхідність мати спеціальне обладнання і досвід його використання, 
						висока вартість оренди або покупки такого обладнання, складність регулювання товщини і якості штукатурного шару, можливість пошкодження обладнання або основи в разі неправильної експлуатації.`,
					},
				],
			},
			{
				label:
					'Як правильно підготувати стіни під машинну штукатурку і які вимоги до них? ',
				answers: [
					{
						paragraph: `Стіни під машинну штукатурку повинні бути міцними, чистими, сухими і рівними. 
						Перед початком робіт необхідно зняти всі старі шари штукатурки, фарби, шпалери, плитки тощо. Також необхідно усунути всі тріщини, вибоїни, нерівності, порожнини, які можуть бути на стінах.`,
					},
					{
						paragraph: `Якщо стіни дуже нерівні, то потрібно зробити попередню стяжку або використати самовирівнюючу суміш.`,
					},
					{
						paragraph: `Якщо стіни дуже вологі, то потрібно зробити гідроізоляцію або використати спеціальні добавки, які зменшують вплив вологи на штукатурку.`,
					},
				],
			},
		],
	},
	roofing: {
		metaData: {
			title: 'Покрівля, Розуклон поверхні',
			description: `Інноваційний метод - Розуклонка плоского даху це процес встановлення нахилу на плоский дах, який допомагає воді стікати від центру до країв даху і водовідводів. 
			Цей процес дуже важливий для запобігання зберігання води на даху та запобігати виникненню проблем з витоками та руйнуванням покриття даху. Працюємо в Вінниці та Вінницькій області. 
			Зробимо швидко та на високому рівні, телефонуйте, або замовляйте консультацію, станьте нашим партнером вже зараз!`,
			image: '/images/rozuklon_4.jpg',
		},
		hero: {
			heading: 'Покрівля поверхні інноваційним методом розуклонів',
			description:
				'Гарантуємо найкращу покрівлю поверхні методом розуклону поверхні будь-якої складності. Обіцяємо надійність, швидкість та якість за приємну ціну у місті Вінниця та Вінницькій області.',
			image: '/images/rozuklon_1.jpg',
			alt: 'Міні-плакат - Покрівля поверхні методом розуклонів',
		},
		description: {
			heading: 'Покриття дахів метод розуклонки поверхні',
			description: [
				{
					paragraph: `Створення покрівлі за допомогою методу Розуклонів представляє собою новаторський підхід, спрямований на створення надійних та високоякісних покрівельних систем. 
					Цей метод, який використовує ту ж саму передову технологію, що і при застосуванні напівсухої стяжки для підлог, виявляється відмінним рішенням для влаштування нахилених 
					покрівель або створення необхідних уклонів для ефективного відведення води.`,
				},
				{
					paragraph: `Метод розуклонів відкриває нові перспективи у побудові покрівель, забезпечуючи не лише стійкість та довговічність, але й оптимальну систему для відводу опадів. 
					Застосування цього методу дозволяє досягти високої якості влаштування покрівлі, забезпечуючи при цьому ефективне відведення води від поверхні. 
					Це важливо не лише для забезпечення тривалого функціонування покрівлі, але і для забезпечення захисту будівлі від впливу атмосферних опадів та забезпечення комфорту в приміщенні.`,
				},
			],
			image: '/images/rozuklon_4.jpg',
			alt: 'STPRO-VIN покрівля з розуклонами - опис',
		},
		advantages: {
			heading: 'Переваги покриття методом розуклонів',
			list: [
				{
					text: `Оптимальний уклон: Метод дозволяє створити точно налаштований уклон, що забезпечує ефективне стокування води та попереджає утворення стоячої води.`,
				},
				{
					text: `Універсальність застосування: Покрівля методом Розуклонів ідеально підходить для будь-якого типу даху чи поверхні, де необхідно керувати напрямком водостоку.`,
				},
				{
					text: `Міцність та висока тривалість: Використання високоякісних матеріалів гарантує надійність та довговічність покрівельної системи.`,
				},
				{
					text: `Захист від вологи: Ідеальне рішення для створення водонепроникних та надійних покрівель, які забезпечують довговічний захист будівлі.`,
				},
				{
					text: `Енергоефективність: Плоский дах може забезпечувати кращу термоізоляцію, ніж крутий дах, тому він може допомогти знизити витрати на опалення та охолодження приміщення.`,
				},
				{
					text: `Естетика: Плоский дах може мати більш сучасний та стильний вигляд, що може підкреслити архітектурний дизайн будівлі.`,
				},
			],
			image: '/images/rozuklon_2.jpg',
			alt: 'Покрівля метод розуклонів - переваги',
		},
		whenStart: {
			heading: 'Як правильно зробити розуклонку даху?',
			list: [
				{
					text: `Професійний аналіз: Спочатку важливо визначити потрібний нахил плоского даху. Для цього необхідно враховувати площу даху, розмір покриття та інші фактори. 
					Найчастіше застосовують нахил від 1% до 5% в залежності від розміру та конфігурації даху.`,
				},
				{
					text: `Визначення необхідного уклону: Залежно від типу покрівлі та місцевих умов, визначте оптимальний кут нахилу для забезпечення ефективного відведення води. 
					Найчастіше застосовують нахил від 1% до 5% в залежності від розміру та конфігурації даху.`,
				},
				{
					text: `Підготувати поверхню: Перед встановленням розуклонки необхідно підготувати поверхню даху, щоб забезпечити якість та довговічність робіт. 
					Поверхню необхідно очистити від бруду, пилу та інших забруднень. Якщо поверхня не рівна, її можна вирівняти за допомогою спеціальних матеріалів, наприклад, рідинного рівнителя.`,
				},
				{
					text: `Зробити розуклонку: Укласти смуги цементно-піщаного розчину по маяках. Вирівняти його. Відшліфувати поверхню.`,
				},
				{
					text: `Перевірити нахил: Після завершення монтажу слід перевірити, чи він правильний. Якщо все добре – здаємо роботу.`,
				},
			],
			image: '/images/rozuklon_5.png',
			alt: 'Покрівля даху з уклоном (виконана)',
		},
		prices: {
			ourMaterials: '260',
			customerMaterials: '160',
		},
		faq: [
			{
				label:
					'Що таке покрівля пласких дахів машинною стяжкою і чим вона краща за традиційну?',
				answers: [
					{
						paragraph: `Покрівля пласких дахів машинною стяжкою - це сучасний спосіб вирівнювання поверхні даху за допомогою спеціального розчину, який подається на об’єкт механізованим способом. 
						Така покрівля має ряд переваг перед традиційною, таких як: висока швидкість виконання, мінімальна вологість, висока міцність, рівномірність, екологічність, можливість укладання на різні основи, зручність для подальшого покриття.`,
					},
				],
			},
			{
				label:
					'Які види покрівельного матеріалу можна використовувати для покрівлі пласких дахів машинною стяжкою і як вони впливають на її характеристики?',
				answers: [
					{
						paragraph: `Для покрівлі пласких дахів машинною стяжкою використовувуються ті ж самі матеріали, що і для напівсухої стяжки.`,
					},
				],
			},
			{
				label:
					'Як правильно виміряти і розрахувати кількість матеріалу для покрівлі пласких дахів машинною стяжкою?',
				answers: [
					{
						paragraph: `Для правильного вимірювання і розрахунку кількості матеріалу для покрівлі методом розуклонів потрібно виконати наступні кроки:`,
					},
					{
						paragraph: `1. Визначити площу покрівлі, враховуючи всі скати, виїми, виступи, карнизи, фронтони тощо;`,
					},
					{
						paragraph: `2.Визначити кількість і розміри розуклонів, враховуючи мінімальний і максимальний кут нахилу, мінімальну і максимальну довжину смуг, мінімальну і максимальну ширину смуг, мінімальну і максимальну відстань між смугами;`,
					},
				],
			},
		],
	},
};

const setData = routeParams => {
	switch (routeParams.servise) {
		case 'screed': {
			return data.screed;
		}
		case 'plaster': {
			return data.plaster;
		}
		case 'roofing': {
			return data.roofing;
		}
		default:
			break;
	}
};

function ServisesPage({ params }) {
	const serviseData = setData(params);

	return (
		<>
			<MiniHero
				heading={serviseData.hero.heading}
				description={serviseData.hero.description}
				image={serviseData.hero.image}
				alt={serviseData.hero.alt}
			/>
			<ServiseDescription data={serviseData.description} />
			<ServiseAdvantages data={serviseData.advantages} />
			<CostCalculation data={serviseData.prices} />
			<ServiseWhenStart data={serviseData.whenStart} />
			<ContactsBanner />
			<FAQ data={serviseData.faq} />
			<Quote
				image="/images/quote_1.jpg"
				alt="Цитата - Джон Л. Джонсон"
				autor="Джон Л. Джонсон"
			>
				Якість – <span> це наша краща стратегія</span> бізнесу
			</Quote>
		</>
	);
}

export default ServisesPage;
