import ContactsBanner from '@/components/contacts-banner';
import CostCalculation from '@/components/costCalculation';
import FAQ from '@/components/faq';
import MiniHero from '@/components/mini-hero';
import Quote from '@/components/quote';
import ServiseAdvantages from '@/components/servise-advantages';
import ServiseDescription from '@/components/servise-description';
import ServiseWhenStart from '@/components/servise-when-start';

export const metadata = {
	title: 'Покрівля, Розуклон поверхні',
	description: `Інноваційний метод - Розуклонка плоского даху це процес встановлення нахилу на плоский дах, який допомагає воді стікати від центру до країв даху і водовідводів. 
			Цей процес дуже важливий для запобігання зберігання води на даху та запобігати виникненню проблем з витоками та руйнуванням покриття даху. Працюємо в Вінниці та Вінницькій області. 
			Зробимо швидко та на високому рівні, телефонуйте, або замовляйте консультацію, станьте нашим партнером вже зараз!`,
	openGraph: {
		images: '/images/rozuklon_2.jpg',
	},
};

const serviseData = {
	hero: {
		heading: 'Покрівля поверхні інноваційним методом розуклонів',
		description:
			'Гарантуємо найкращу покрівлю поверхні методом розуклону поверхні будь-якої складності. Обіцяємо надійність, швидкість та якість за приємну ціну у місті Вінниця та Вінницькій області.',
		image: '/images/rozuklon_1.jpg',
		alt: 'Міні-плакат - Покрівля поверхні методом розуклонів',
	},
	description: {
		heading: 'Покриття дахів метод розуклонки поверхні',
		description: [
			{
				paragraph: `Створення покрівлі за допомогою методу Розуклонів представляє собою новаторський підхід, спрямований на створення надійних та високоякісних покрівельних систем. 
					Цей метод, який використовує ту ж саму передову технологію, що і при застосуванні напівсухої стяжки для підлог, виявляється відмінним рішенням для влаштування нахилених 
					покрівель або створення необхідних уклонів для ефективного відведення води.`,
			},
			{
				paragraph: `Метод розуклонів відкриває нові перспективи у побудові покрівель, забезпечуючи не лише стійкість та довговічність, але й оптимальну систему для відводу опадів. 
					Застосування цього методу дозволяє досягти високої якості влаштування покрівлі, забезпечуючи при цьому ефективне відведення води від поверхні. 
					Це важливо не лише для забезпечення тривалого функціонування покрівлі, але і для забезпечення захисту будівлі від впливу атмосферних опадів та забезпечення комфорту в приміщенні.`,
			},
		],
		image: '/images/rozuklon_4.jpg',
		alt: 'STPRO-VIN покрівля з розуклонами - опис',
	},
	advantages: {
		heading: 'Переваги покриття методом розуклонів',
		list: [
			{
				text: `Оптимальний уклон: Метод дозволяє створити точно налаштований уклон, що забезпечує ефективне стокування води та попереджає утворення стоячої води.`,
			},
			{
				text: `Універсальність застосування: Покрівля методом Розуклонів ідеально підходить для будь-якого типу даху чи поверхні, де необхідно керувати напрямком водостоку.`,
			},
			{
				text: `Міцність та висока тривалість: Використання високоякісних матеріалів гарантує надійність та довговічність покрівельної системи.`,
			},
			{
				text: `Захист від вологи: Ідеальне рішення для створення водонепроникних та надійних покрівель, які забезпечують довговічний захист будівлі.`,
			},
			{
				text: `Енергоефективність: Плоский дах може забезпечувати кращу термоізоляцію, ніж крутий дах, тому він може допомогти знизити витрати на опалення та охолодження приміщення.`,
			},
			{
				text: `Естетика: Плоский дах може мати більш сучасний та стильний вигляд, що може підкреслити архітектурний дизайн будівлі.`,
			},
		],
		image: '/images/rozuklon_2.jpg',
		alt: 'Покрівля метод розуклонів - переваги',
	},
	whenStart: {
		heading: 'Як правильно зробити розуклонку даху?',
		list: [
			{
				text: `Професійний аналіз: Спочатку важливо визначити потрібний нахил плоского даху. Для цього необхідно враховувати площу даху, розмір покриття та інші фактори. 
					Найчастіше застосовують нахил від 1% до 5% в залежності від розміру та конфігурації даху.`,
			},
			{
				text: `Підготувати поверхню: Перед встановленням розуклонки необхідно підготувати поверхню даху, щоб забезпечити якість та довговічність робіт. 
					Поверхню необхідно очистити від бруду, пилу та інших забруднень. Якщо поверхня не рівна, її можна вирівняти за допомогою спеціальних матеріалів, наприклад, рідинного рівнителя.`,
			},
			{
				text: `Зробити розуклонку: Укласти смуги цементно-піщаного розчину по маяках. Вирівняти його. Відшліфувати поверхню.`,
			},
			{
				text: `Перевірити нахил: Після завершення монтажу слід перевірити, чи він правильний. Якщо все добре – здаємо роботу.`,
			},
		],
		image: '/images/rozuklon_5.png',
		alt: 'Покрівля даху з уклоном (виконана)',
	},
	prices: {
		ourMaterials: '310',
		customerMaterials: '130',
	},
	faq: [
		{
			label:
				'Що таке покрівля пласких дахів машинною стяжкою і чим вона краща за традиційну?',
			answers: [
				{
					paragraph: `Покрівля пласких дахів машинною стяжкою - це сучасний спосіб вирівнювання поверхні даху за допомогою спеціального розчину, який подається на об’єкт механізованим способом. 
						Така покрівля має ряд переваг перед традиційною, таких як: висока швидкість виконання, мінімальна вологість, висока міцність, рівномірність, екологічність, можливість укладання на різні основи, зручність для подальшого покриття.`,
				},
			],
		},
		{
			label:
				'Які види покрівельного матеріалу можна використовувати для покрівлі пласких дахів машинною стяжкою і як вони впливають на її характеристики?',
			answers: [
				{
					paragraph: `Для покрівлі пласких дахів машинною стяжкою використовувуються ті ж самі матеріали, що і для напівсухої стяжки.`,
				},
			],
		},
		{
			label:
				'Як правильно виміряти і розрахувати кількість матеріалу для покрівлі пласких дахів машинною стяжкою?',
			answers: [
				{
					paragraph: `Для правильного вимірювання і розрахунку кількості матеріалу для покрівлі методом розуклонів потрібно виконати наступні кроки:`,
				},
				{
					paragraph: `1. Визначити площу покрівлі, враховуючи всі скати, виїми, виступи, карнизи, фронтони тощо;`,
				},
				{
					paragraph: `2.Визначити кількість і розміри розуклонів, враховуючи мінімальний і максимальний кут нахилу, мінімальну і максимальну довжину смуг, мінімальну і максимальну ширину смуг, мінімальну і максимальну відстань між смугами;`,
				},
			],
		},
	],
};

function RoofingPage() {
	return (
		<>
			<MiniHero
				heading={serviseData.hero.heading}
				description={serviseData.hero.description}
				image={serviseData.hero.image}
				alt={serviseData.hero.alt}
			/>
			<ServiseDescription data={serviseData.description} />
			<ServiseAdvantages data={serviseData.advantages} />
			<CostCalculation data={serviseData.prices} />
			<ServiseWhenStart data={serviseData.whenStart} />
			<ContactsBanner />
			<FAQ data={serviseData.faq} />
			<Quote
				image="/images/quote_1.jpg"
				alt="Цитата - Джон Л. Джонсон"
				autor="Джон Л. Джонсон"
			>
				Якість – <span> це наша краща стратегія</span> бізнесу
			</Quote>
		</>
	);
}

export default RoofingPage;
