import ContactsBanner from '@/components/contacts-banner';
import CostCalculation from '@/components/costCalculation';
import FAQ from '@/components/faq';
import MiniHero from '@/components/mini-hero';
import Quote from '@/components/quote';
import ServiseAdvantages from '@/components/servise-advantages';
import ServiseDescription from '@/components/servise-description';
import ServiseWhenStart from '@/components/servise-when-start';

export const metadata = {
	title: 'Машинна Напівсуха Стяжка Підлоги',
	description: `Найкращий спосіб зробити підлогу ідеально рівною - це замовити Машинну напівсуху стяжку підлоги у спецалістів з компанії STPRO-VIN у Вінниці та області, 
			фіксована ціна протягом виконання роботи, безкоштовний виклик замірника, найкращий матеріал, до 300 кв.м за день, швидко, якісно та довговічно!`,
	openGraph: {
		images: '/images/styazhka_3.jpg',
	},
};

const serviseData = {
	hero: {
		heading:
			'Машинна напівсуха стяжка підлоги: Ідеальна основа для Вашого житла',
		description: `Високоякісні рішення в області стяжки підлоги для максимального комфорту та довговічності. 
				Гарантуємо найрівнішу поверхню, швидкість та якість за приємну ціну у місті Вінниця та Вінницькій області.`,
		image: '/images/styazhka_4.jpg',
		alt: 'Міні-плакат - Машинна стяжка підлоги',
	},
	description: {
		heading: 'Що таке машинна стяжка підлоги?',
		description: [
			{
				paragraph: `Машинна напівсуха стяжка представляє собою ефективний метод вирівнювання поверхні підлоги, що використовує механізований підхід. 
				Цей спосіб знаходить своє застосування при ремонті квартир в новобудовах або приватних будинках, дозволяючи швидко та якісно вирівняти підлогу за передовою німецькою технологією.`,
			},
			{
				paragraph: `Основний компонент напівсухої стяжки – це суміш, яка включає великозернистий пісок, цемент, фіброволокно і пластифікатор. 
				Ці складові дозволяють досягти високої якості вирівнювання підлоги, ефективно усуваючи нерівності та значні перепади на її поверхні. 
				Використання цієї технології сприяє швидкому завершенню робіт і отриманню ідеальної гладкості підлоги, що є важливим етапом в будівельних та ремонтних процесах.`,
			},
		],
		image: '/hero.jpg',
		alt: 'STPRO-VIN машинна сятжка - опис',
	},
	advantages: {
		heading: 'Переваги машинної стяжки підлоги',
		list: [
			{
				text: `Швидкість виконання: машинна стяжка виконується швидше за ручну, тому що машинна техніка дозволяє розподілити матеріал рівномірно та швидко.`,
			},
			{
				text: `Висока якість: машинна стяжка забезпечує більш рівномірну та гладку поверхню, що робить її ідеальною для встановлення підлогових покриттів, 
					таких як ковролін, ламінат, плитка, паркет та ін.`,
			},
			{
				text: `Висока Міцність: Використання спеціальних добавок та якісних матеріалів забезпечує високу міцність стяжки, що робить її ідеальним вибором для будь-якого приміщення.`,
			},
			{
				text: `Економія матеріалів: машинна стяжка забезпечує більш точне дозування матеріалів, що дозволяє зменшити витрати на матеріали та знизити відходи.`,
			},
			{
				text: `Економія витрат: використання машинної стяжки підлоги може бути економічно вигіднішим за ручну стяжку. За рахунок зменшення часу, 
					витраченого на виконання робіт, зниження кількості матеріалів та кращої якості робіт, машинна стяжка може бути більш ефективним варіантом.`,
			},
		],
		image: '/images/styazhka_6.jpg',
		alt: 'Зашліфована стяжка підлоги 1',
	},
	whenStart: {
		heading: 'Коли варто робити стяжку:',
		list: [
			{
				text: `Після встановлення систем водопостачання та водовідведення: 
					Якщо ви плануєте встановити сантехніку або системи водопостачання та водовідведення, то перш за все необхідно встановити їх перед початком робіт зі стяжкою підлоги. 
					Встановлення цих систем перед стяжкою підлоги забезпечить можливість розташування труб та інших елементів підлоги за межами стяжки.`,
			},
			{
				text: `Після установки теплоізоляції: 
					Якщо ви встановлюєте теплоізоляцію підлоги, то рекомендується зробити стяжку після її встановлення. 
					Таким чином, ви можете впевнитися, що теплоізоляція захищена та правильно встановлена.`,
			},
			{
				text: `Перед встановленням підлогового покриття: 
					Якщо ви плануєте встановити підлогове покриття, таке як керамічна плитка або ламінат, то рекомендується зробити стяжку підлоги перед початком укладання покриття. 
					Це забезпечить рівну та стійку поверхню для укладання покриття.`,
			},
			{
				text: `Після завершення внутрішніх робіт: 
					Якщо ви робите ремонт в квартирі або будинку, то рекомендується починати роботи зі стяжкою підлоги після завершення внутрішніх робіт, 
					таких як фарбування, обшивка стін або установка дверей. Це допоможе зменшити можливість пошкодження стяжки підлоги під час проведення інших робіт.`,
			},
		],
		image: '/images/styazhka_work_3.jpg',
		alt: 'Процес роботи майстра STPRO-VIN',
	},
	prices: {
		ourMaterials: '290',
		customerMaterials: '130',
	},
	faq: [
		{
			label:
				'Що таке машинна напівсуха стяжка підлоги і чим вона краща за традиційну?',
			answers: [
				{
					paragraph: `Машинна напівсуха стяжка підлоги - це сучасний спосіб вирівнювання поверхні підлоги за допомогою спеціального розчину, який подається на об’єкт механізованим способом. 
						Така стяжка має ряд переваг перед традиційною, таких як: висока швидкість виконання, мінімальна вологість, висока міцність, рівномірність, екологічність, 
						можливість укладання на різні основи, зручність для подальшого покриття.`,
				},
			],
		},
		{
			label:
				'Яка товщина машинної напівсухої стяжки підлоги і як вона впливає на якість роботи?',
			answers: [
				{
					paragraph: `Товщина машинної напівсухої стяжки підлоги залежить від рівності основи, виду покриття і додаткових шарів, які можуть бути прокладені під стяжку, таких як теплоізоляція, гідроізоляція, армування тощо. 
						Зазвичай товщина стяжки коливається від 3 до 10 см. Якщо товщина стяжки занадто мала, це може призвести до її розтріскування, деформації або нерівномірності. 
						Якщо товщина стяжки занадто велика, це може призвести до зайвих витрат матеріалів, збільшення ваги стяжки і погіршення теплопровідності.`,
				},
			],
		},
		{
			label:
				'Як правильно підготувати основу під машинну напівсуху стяжку підлоги і які вимоги до неї?',
			answers: [
				{
					paragraph: `Основа під машинну напівсуху стяжку підлоги повинна бути міцною, стійкою, чистою, сухою і рівною. Перед укладанням стяжки необхідно зняти всі залишки попереднього покриття, пил, грязь, жир, масло, фарбу, грибок, плісняву тощо. 
						Також необхідно усунути всі тріщини, вибоїни, нерівності, порожнини, які можуть бути на основі. Якщо основа дуже нерівна, то потрібно зробити попередню стяжку або використати самовирівнюючу суміш. Якщо основа дуже волога, то потрібно зробити гідроізоляцію або використати спеціальні добавки, які зменшують вплив вологи на стяжку.`,
				},
			],
		},
		{
			label:
				'Як доглядати за машинною напівсухою стяжкою підлоги після її укладання і які терміни експлуатації вона має?',
			answers: [
				{
					paragraph: `Машинна напівсуха стяжка підлоги після її укладання потребує дотримання деяких правил догляду, щоб забезпечити її довговічність і якість. Основні правила догляду такі:`,
				},
				{
					paragraph: `1. Не ходити по стяжці протягом перших 24 годин після її укладання;`,
				},
				{
					paragraph: `2. Не ставити на стяжку важкі предмети, інструменти, обладнання протягом перших 7 днів після її укладання;`,
				},
				{
					paragraph: `3. Не укладати на стяжку кінцеве покриття протягом перших 28 днів після її укладання;`,
				},
				{
					paragraph: `4. Забезпечити оптимальний мікроклімат в приміщенні, де зроблена стяжка, тобто температуру від 15 до 25 градусів, вологість від 50 до 70%, вентиляцію і освітлення;`,
				},
				{
					paragraph: `Машинна напівсуха стяжка підлоги має досить високі терміни експлуатації, якщо дотримуватися правил догляду і використовувати якісні матеріали. 
						Зазвичай така стяжка служить від 10 до 20 років, але це також залежить від інтенсивності навантаження на підлогу, типу покриття, кліматичних умов тощо.`,
				},
			],
		},
	],
};

function ScreedPage() {
	return (
		<>
			<MiniHero
				heading={serviseData.hero.heading}
				description={serviseData.hero.description}
				image={serviseData.hero.image}
				alt={serviseData.hero.alt}
			/>
			<ServiseDescription data={serviseData.description} />
			<ServiseAdvantages data={serviseData.advantages} />
			<CostCalculation data={serviseData.prices} />
			<ServiseWhenStart data={serviseData.whenStart} />
			<ContactsBanner />
			<FAQ data={serviseData.faq} />
			<Quote
				image="/images/quote_1.jpg"
				alt="Цитата - Джон Л. Джонсон"
				autor="Джон Л. Джонсон"
			>
				Якість – <span> це наша краща стратегія</span> бізнесу
			</Quote>
		</>
	);
}

export default ScreedPage;
