import ContactsBanner from '@/components/contacts-banner';
import CostCalculation from '@/components/costCalculation';
import FAQ from '@/components/faq';
import MiniHero from '@/components/mini-hero';
import Quote from '@/components/quote';
import ServiseAdvantages from '@/components/servise-advantages';
import ServiseDescription from '@/components/servise-description';
import ServiseWhenStart from '@/components/servise-when-start';

export const metadata = {
	title: 'Машинна Штукатурка Стін',
	description: `Послуга Машинної штукатурки у місті Вінниця під ключ, зробимо все швидко якісно, зв'яжіться з нами та обговоримо деталі, якщо у вас великий об’єм робіт, 
			то вартість за кв.м може бути меншою. За допомогою спеціальної технології та кваліфікованих майстрів перетворимо ваші стіни на витвір мистецва`,
	openGraph: {
		images: '/images/plaster_2.jpg',
	},
};

const serviseData = {
	hero: {
		heading: 'Машинна штукатурка стін: Новий рівень естетики та надійності',
		description:
			'Професійна обробка стін, яка поєднує елегантність, швидкість та якість за приємну ціну у місті Вінниця.',
		image: '/images/plaster_1.jpg',
		alt: 'Міні-плакат - Машинна штукатурка стін',
	},
	description: {
		heading: 'Машинна штукатурка стін',
		description: [
			{
				paragraph: `Машинна штукатурка стін представляє собою інноваційний, ефективний і економічний метод підготовки як зовнішніх, так і внутрішніх поверхонь перед завершальним оздобленням. 
					Цей сучасний підхід ґрунтується на використанні спеціальної машини, яка здатна працювати як з гіпсовими, так і з цементно-вапняними сумішами, забезпечуючи високий ступінь якості обробки поверхні. `,
			},
			{
				paragraph: `Процес машинного оштукатурювання включає кілька етапів, які допомагають досягти оптимальних результатів. По-перше, поверхню готують, очищаючи її від будь-яких дефектів і нерівностей. 
					Потім спеціальна машина рівномірно та швидко розподіляє штукатурку по стіні, дозволяючи отримати гладку і однорідну поверхню.`,
			},
			{
				paragraph: `Машинна штукатурка стін в м.Вінниця від нашої компанії – це не просто обробка поверхні, це творчий підхід який вразить своєю красою та індивідуальністю.`,
			},
		],
		image: '/images/plaster_3.jpg',
		alt: 'STPRO-VIN машинна штукатурка - опис',
	},
	advantages: {
		heading: 'Переваги машинної штукатурки',
		list: [
			{
				text: 'Швидкість виконання робіт: Машинний процес дозволяє ефективно виконувати штукатурні роботи, зекономивши час та забезпечивши якісний результат.',
			},
			{
				text: 'Міцність та стійкість: Матеріали високої якості гарантують міцність та стійкість покриття, що залишається незмінним протягом тривалого часу.',
			},
			{
				text: 'Рівномірність та гладкість: Завдяки точному дозуванню матеріалів та автоматизованому процесу нанесення, ми досягаємо ідеально гладкої поверхні.',
			},
			{
				text: 'Економія матеріалів: машинна штукатурка може ефективно використовувати матеріали, оскільки вона точно дозує їх та наносить на стіни без втрат.',
			},
		],
		image: '/images/plaster_4.jpg',
		alt: 'Машинна штукатурка "Переваги"',
	},
	whenStart: {
		heading: 'Коли варто робити стяжку:',
		list: [
			{
				text: `Будівництво нових будинків або ремонт і реконструкція старих: 
					Машинна штукатурка може бути корисною для створення рівномірного та гладкого шару на поверхнях стін, що дозволяє створити привабливий та якісний фініш.`,
			},
			{
				text: `Використання на великих площах: 
					Машинна штукатурка є швидшою та більш продуктивною, ніж ручна штукатурка, тому її можна застосовувати на великих площах, таких як склади, промислові будівлі, багатоквартирні будинки та інші.`,
			},
			{
				text: `Робота в умовах обмеженої доступності: 
					Машинна штукатурка може бути використана в умовах, коли ручна штукатурка є неможливою або неефективною.`,
			},
			{
				text: `Зниження вартості робіт: 
					Машинна штукатурка може допомогти знизити витрати на працю та матеріали порівняно з ручною штукатуркою, що може бути важливим фактором при бюджетуванні будівельних робіт.`,
			},
		],
		image: '/images/plaster_2.jpg',
		alt: 'Штукатурка стін (завершена)',
	},
	prices: {
		ourMaterials: '330',
		customerMaterials: '140',
	},
	faq: [
		{
			label:
				'Які види машинної штукатурки стін ви пропонуєте і як вибрати найкращий для мого інтер’єру?',
			answers: [
				{
					paragraph: `Ми пропонуємо два види машинної штукатурки стін: гіпсову і цементно-піщану.`,
				},
				{
					paragraph: `- Гіпсова штукатурка ідеально підходить для внутрішніх робіт, оскільки вона має високу адгезію, гладкість, білизну, паропроникність і вогнестійкість.`,
				},
				{
					paragraph: `- Цементно-піщана штукатурка рекомендується для зовнішніх робіт, оскільки вона стійка до атмосферних впливів, механічних пошкоджень, грибків і плісняви.`,
				},
				{
					paragraph: `Вибір виду штукатурки залежить від типу стін, кліматичних умов, бюджету і дизайну інтер’єру.`,
				},
			],
		},
		{
			label:
				'Які переваги машинної штукатурки стін перед ручною і чи є якісь недоліки?',
			answers: [
				{
					paragraph: `Машинна штукатурка стін має ряд переваг перед ручною, таких як: висока швидкість виконання, мінімальна витрата матеріалу, рівномірність і якість нанесення, 
						зниження фізичного навантаження на робітників, зменшення кількості пилу і бруду в приміщенні.`,
				},
				{
					paragraph: `Недоліки машинної штукатурки стін можуть бути такі: необхідність мати спеціальне обладнання і досвід його використання, 
						висока вартість оренди або покупки такого обладнання, складність регулювання товщини і якості штукатурного шару, можливість пошкодження обладнання або основи в разі неправильної експлуатації.`,
				},
			],
		},
		{
			label:
				'Як правильно підготувати стіни під машинну штукатурку і які вимоги до них? ',
			answers: [
				{
					paragraph: `Стіни під машинну штукатурку повинні бути міцними, чистими, сухими і рівними. 
						Перед початком робіт необхідно зняти всі старі шари штукатурки, фарби, шпалери, плитки тощо. Також необхідно усунути всі тріщини, вибоїни, нерівності, порожнини, які можуть бути на стінах.`,
				},
				{
					paragraph: `Якщо стіни дуже нерівні, то потрібно зробити попередню стяжку або використати самовирівнюючу суміш.`,
				},
				{
					paragraph: `Якщо стіни дуже вологі, то потрібно зробити гідроізоляцію або використати спеціальні добавки, які зменшують вплив вологи на штукатурку.`,
				},
			],
		},
	],
};

function PlasterPage() {
	return (
		<>
			<MiniHero
				heading={serviseData.hero.heading}
				description={serviseData.hero.description}
				image={serviseData.hero.image}
				alt={serviseData.hero.alt}
			/>
			<ServiseDescription data={serviseData.description} />
			<ServiseAdvantages data={serviseData.advantages} />
			<CostCalculation data={serviseData.prices} />
			<ServiseWhenStart data={serviseData.whenStart} />
			<ContactsBanner />
			<FAQ data={serviseData.faq} />
			<Quote
				image="/images/quote_1.jpg"
				alt="Цитата - Джон Л. Джонсон"
				autor="Джон Л. Джонсон"
			>
				Якість – <span> це наша краща стратегія</span> бізнесу
			</Quote>
		</>
	);
}

export default PlasterPage;
